#1.Даны целые числа a, b, c, являющиеся сторонами некоторого треугольника.
#Проверить истинность высказывания: «Треугольник со сторонами a, b, c является
#равнобедренным».
#2. Даны три числа. Найти сумму двух наибольших из них.

#задание 1
a=input("Введите первую сторону треугольника:")
b=input("Введите вторую сторону треугольника:")
c=input("Введите третью сторону треугольника:")

while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print("НЕПРАВЕЛЬНО ВВЕЛИ!")
        a = input("Введитечисло первую сторону треугольникаещё раз:")
while type(b) != int:
    try:
        b = int(b)
    except ValueError:
        print("НЕПРАВЕЛЬНО ВВЕЛИ!")
        b = input("Введитечисло вторую сторону треугольникаещё раз:")
while type(c) != int:
    try:
        c = int(c)
    except ValueError:
        print("НЕПРАВЕЛЬНО ВВЕЛИ!")
        c = input("Введитечисло третью сторону треугольникаещё раз:")

if a==b==c:
    print("треугольник равносторонний. т.к. каждая его сторона равна", a)
else:
    print("треугольнк не равносторонний, так как не все стороно равны")





#задание 2

if a>=b>=c:
    print("ссума двух наибольших чисел:",a+b)
elif a>=c>=b:
    print("ссума двух наибольших чисел:",a+c)
elif b>=a>=c:
    print("ссума двух наибольших чисел:",b+a)
elif b>=c>=a:
    print("ссума двух наибольших чисел:",b+c)
elif c>=a>=b:
    print("ссума двух наибольших чисел:",a+c)
elif c>=b>=a:
    print("ссума двух наибольших чисел:",b+c)
