#1.Даны целые числа a, b, c, являющиеся сторонами некоторого треугольника.
#Проверить истинность высказывания: «Треугольник со сторонами a, b, c является
#равнобедренным».
#2. Даны три числа. Найти сумму двух наибольших из них.

a,b,c,=int(input("Введите первую сторону треугольника:")),int(input("Введите вторую сторону треугольника:")),int(input("Введите третью сторону треугольника:"))


if a==b==c:
    print("треугольник равносторонний. т.к. каждая его сторона равна", a)
else:
    print("треугольнк не равносторонний, так как не все стороно равны")

if a>b>c:
    print(a+b)
elif a>c>b:
    print(a+c)
elif b>a>c:
    print(b+a)
elif b>c>a:
    print(b+c)
elif c>a>b:
    print(a+c)
elif c>b>a:
    print(b+c)
