
while 19:
    try:
        a = int(input("Введите день года (1-365): "))
        if a >365:
            a = "ed"
        break
    except ValueError:
        print("Введите коректное значение, от 1 до 365")

b = (a % 7) + 1

if b == 1:
     print("номер дня недели:",b,"понидельник")

elif b == 2:
    print("номер дня недели:",b,"вторник")

elif b == 3:
    print("номер дня недели:", b, "среда")

elif b == 4:
    print("номер дня недели:", b, "четверг")

elif b == 5:
    print("номер дня недели:", b, "пятница")

elif b == 6:
    print("номер дня недели:", b, "суббота")

elif b == 7:
    print("номер дня недели:", b, "воскресение")
